var allcity=[
    {
        "name": "安吉",
        "sub": [
            {
                "name": "浙江省湖州市安吉县"
            }
        ],
        "type": 1
    },
    {
        "name": "常熟",
        "sub": [
            {
                "name": "江苏省常熟市"
            }
        ],
        "type": 1
    },
    {
        "name": "常州",
        "sub": [
            {
                "name": "江苏省常州市"
            }
        ],
        "type": 1
    },
    {
        "name": "滁州",
        "sub": [
            {
                "name": "安徽省滁州市"
            }
        ],
        "type": 1
    },
    {
        "name": "慈溪",
        "sub": [
            {
                "name": "浙江宁波慈溪"
            }
        ],
        "type": 1
    },
    {
        "name": "丹阳",
        "sub": [
            {
                "name": "江苏省镇江市丹阳镇"
            }
        ],
        "type": 1
    },
    {
        "name": "德清",
        "sub": [
            {
                "name": "浙江省湖州市德清县"
            }
        ],
        "type": 1
    },
    {
        "name": "东海",
        "sub": [
            {
                "name": "江苏省连云港市东海县"
            }
        ],
        "type": 1
    },
    {
        "name": "东阳",
        "sub": [
            {
                "name": "浙江省金华市东阳市"
            }
        ],
        "type": 1
    },
    {
        "name": "富阳",
        "sub": [
            {
                "name": "浙江省杭州市富阳市"
            }
        ],
        "type": 1
    },
    {
        "name": "丰县",
        "sub": [
            {
                "name": "江苏省徐州市凤城县"
            }
        ],
        "type": 1
    },
    {
        "name": "赣榆",
        "sub": [
            {
                "name": "江苏省连云港市赣榆县"
            }
        ],
        "type": 1
    },
    {
        "name": "高淳",
        "sub": [
            {
                "name": "江苏省南京市高淳县"
            }
        ],
        "type": 1
    }, {
        "name": "高港",
        "sub": [
            {
                "name": "江苏省泰州市高港区"
            }
        ],
        "type": 1
    },
    {
        "name": "海安",
        "sub": [
            {
                "name": "江苏省南通市海安县"
            }
        ],
        "type": 1
    },
    {
        "name": "海宁",
        "sub": [
            {
                "name": "浙江省嘉兴市海宁市"
            }
        ],
        "type": 1
    },
    {
        "name": "海盐",
        "sub": [
            {
                "name": "浙江省嘉兴市海盐县"
            }
        ],
        "type": 1
    },
    {
        "name": "杭州",
        "sub": [
            {
                "name": "浙江省杭州市"
            }
        ],
        "type": 1
    },
    {
        "name": "合肥",
        "sub": [
            {
                "name": "安徽省合肥市"
            }
        ],
        "type": 1
    },
    {
        "name": "洪泽",
        "sub": [
            {
                "name": " 江苏省淮阴市洪泽县"
            }
        ],
        "type": 1
    },
    {
        "name": "湖州市",
        "sub": [
            {
                "name": "浙江省湖州市"
            }
        ],
        "type": 1
    }, {
        "name": "淮安市",
        "sub": [
            {
                "name": "江苏省淮阴市淮安市 "
            }
        ],
        "type": 1
    },
    {
        "name": "淮北",
        "sub": [
            {
                "name": "安徽省淮北市"
            }
        ],
        "type": 1
    },
    {
        "name": "嘉善",
        "sub": [
            {
                "name": "浙江省嘉兴市嘉善县"
            }
        ],
        "type": 1
    },
    {
        "name": "嘉兴",
        "sub": [
            {
                "name": "浙江省嘉兴市"
            }
        ],
        "type": 1
    },
    {
        "name": "江都",
        "sub": [
            {
                "name": "江苏省扬州市江都市"
            }
        ],
        "type": 1
    }, {
        "name": "江阴",
        "sub": [
            {
                "name":"江苏省无锡市江阴市"
            }
        ],
        "type": 1
    },
    {
        "name": "姜堰",
        "sub": [
            {
                "name": "江苏省泰州市姜堰市"
            }
        ],
        "type": 1
    },
    {
        "name": "金湖",
        "sub": [
            {
                "name": "江苏省淮阴市金湖县"
            }
        ],
        "type": 1
    }, {
        "name": "金华",
        "sub": [
            {
                "name": " 浙江省金华市"
            }
        ],
        "type": 1
    },
    {
        "name": "金坛",
        "sub": [
            {
                "name": "江苏常州市金坛市"
            }
        ],
        "type": 1
    },
    {
        "name": "靖江",
        "sub": [
            {
                "name": "江苏省泰州市靖江市"
            }
        ],
        "type": 1
    }, {
        "name": "句容",
        "sub": [
            {
                "name": "江苏省镇江市句容市"
            }
        ],
        "type": 1
    },
    {
        "name": "柯桥",
        "sub": [
            {
                "name": "浙江省绍兴市柯桥区"
            }
        ],
        "type": 1
    },
    {
        "name": "昆山",
        "sub": [
            {
                "name": "江苏省苏州市昆山市"
            }
        ],
        "type": 1
    }, {
        "name": "乐清",
        "sub": [
            {
                "name": "浙江省温州市乐清市"
            }
        ],
        "type": 1
    },
    {
        "name": "溧水",
        "sub": [
            {
                "name": "江苏省南京市溧水县"
            }
        ],
        "type": 1
    },

    {
        "name": "溧阳",
        "sub": [
            {
                "name": "江苏省常州市溧阳市"
            }
        ],
        "type": 1
    }, {
        "name": "连云港",
        "sub": [
            {
                "name": "江苏省连云港市"
            }
        ],
        "type": 1
    },
    {
        "name": "临安",
        "sub": [
            {
                "name": "浙江省杭州市临安市"
            }
        ],
        "type": 1
    },
    {
        "name": "马鞍山",
        "sub": [
            {
                "name": "安徽省马鞍山市"
            }
        ],
        "type": 1
    },
    {
        "name": "南京",
        "sub": [
            {
                "name": "江苏省南京市"
            }
        ],
        "type": 1
    },
    {
        "name": "南通",
        "sub": [
            {
                "name": "江苏省南通市"
            }
        ],
        "type": 1
    },
    {
        "name": "宁波",
        "sub": [
            {
                "name": "浙江省宁波市"
            }
        ],
        "type": 1
    },
    {
        "name": "平湖",
        "sub": [
            {
                "name": "浙江省嘉兴市平湖市"
            }
        ],
        "type": 1
    },
    {
        "name": "浦江",
        "sub": [
            {
                "name": "浙江省金华市浦江县"
            }
        ],
        "type": 1
    },
    {
        "name": "启东",
        "sub": [
            {
                "name": "江苏省南通市启东市"
            }
        ],
        "type": 1
    },
    {
        "name": "衢州",
        "sub": [
            {
                "name": "浙江省衢州市"
            }
        ],
        "type": 1
    },
    {
        "name": "如东",
        "sub": [
            {
                "name": "江苏省南通市如东县"
            }
        ],
        "type": 1
    }, {
        "name": "如皋",
        "sub": [
            {
                "name": "江苏省南通市如皋市"
            }
        ],
        "type": 1
    },
    {
        "name": "瑞安",
        "sub": [
            {
                "name": "浙江省温州市瑞安市"
            }
        ],
        "type": 1
    },
    {
        "name": "沙集",
        "sub": [
            {
                "name": "江苏省徐州市睢宁县沙集镇"
            }
        ],
        "type": 1
    }, {
        "name": "上海",
        "sub": [
            {
                "name": "上海市"
            }
        ],
        "type": 1
    },

    {
        "name": "上虞",
        "sub": [
            {
                "name": "浙江省绍兴市上虞市"
            }
        ],
        "type": 1
    },
    {
        "name": "绍兴",
        "sub": [
            {
                "name": "浙江省绍兴市"
            }
        ],
        "type": 1
    }, {
        "name": "泗洪",
        "sub": [
            {
                "name": "江苏省泰州市泗洪县"
            }
        ],
        "type": 1
    },

    {
        "name": "苏州",
        "sub": [
            {
                "name": "江苏省苏州市"
            }
        ],
        "type": 1
    },
    {
        "name": "台州",
        "sub": [
            {
                "name": "浙江省台州市"
            }
        ],
        "type": 1
    },
    {
        "name": "太仓",
        "sub": [
            {
                "name": "江苏省苏州市太仓市"
            }
        ],
        "type": 1
    },
    {
        "name": "泰兴",
        "sub": [
            {
                "name": "江苏省泰州市泰兴市"
            }
        ],
        "type": 1
    },

    {
        "name": "天长",
        "sub": [
            {
                "name": "安徽省滁州市天长市"
            }
        ],
        "type": 1
    },
    {
        "name": "通州",
        "sub": [
            {
                "name": "江苏省苏州市通州市"
            }
        ],
        "type": 1
    },
    {
        "name": "桐庐",
        "sub": [
            {
                "name": "浙江省杭州市桐庐县"
            }
        ],
        "type": 1
    },
    {
        "name": "桐乡",
        "sub": [
            {
                "name": "浙江省嘉兴市桐乡市"
            }
        ],
        "type": 1
    },
    {
        "name": "温州",
        "sub": [
            {
                "name": "浙江省温州市"
            }
        ],
        "type": 1
    },
     {
        "name": "无锡",
        "sub": [
            {
                "name": "江苏省无锡市"
            }
        ],
        "type": 1
    },
    {
        "name": "芜湖",
        "sub": [
            {
                "name": "安徽省芜湖市"
            }
        ],
        "type": 1
    },
    {
        "name": "吴江",
        "sub": [
            {
                "name": "江苏省苏州市吴江市"
            }
        ],
        "type": 1
    },
    {
        "name": "萧山",
        "sub": [
            {
                "name": "浙江省杭州市萧山市"
            }
        ],
        "type": 1
    },
    {
        "name": "兴化",
        "sub": [
            {
                "name": "江苏省泰州市兴化市"
            }
        ],
        "type": 1
    },
    {
        "name": "宿迁",
        "sub": [
            {
                "name": "江苏省泰州市宿迁市"
            }
        ],
        "type": 1
    },
    {
        "name": "徐州",
        "sub": [
            {
                "name": "江苏省徐州市"
            }
        ],
        "type": 1
    },
    {
        "name": "盐城",
        "sub": [
            {
                "name": "江苏省淮阴市盐城市"
            }
        ],
        "type": 1
    },
    {
        "name": "扬州",
        "sub": [
            {
                "name": "江苏省扬州市"
            }
        ],
        "type": 1
    },
    {
        "name": "宜兴",
        "sub": [
            {
                "name": "江苏省无锡市宜兴市"
            }
        ],
        "type": 1
    },
    {
        "name": "义乌",
        "sub": [
            {
                "name": "浙江省金华市义乌市"
            }
        ],
        "type": 1
    },
    {
        "name": "永嘉",
        "sub": [
            {
                "name": "浙江省温州市永嘉市"
            }
        ],
        "type": 1
    },
    {
        "name": "永康",
        "sub": [
            {
                "name": "浙江省金华市永康市"
            }
        ],
        "type": 1
    },
    {
        "name": "余姚",
        "sub": [
            {
                "name": "浙江省宁波市余姚市"
            }
        ],
        "type": 1
    },
    {
        "name": "张家港",
        "sub": [
            {
                "name": "江苏省苏州市张家港市"
            }
        ],
        "type": 1
    },
    {
        "name": "长兴",
        "sub": [
            {
                "name": "浙江省嘉兴市长兴县"
            }
        ],
        "type": 1
    },
    {
        "name": "镇江",
        "sub": [
            {
                "name": "江苏省镇江市"
            }
        ],
        "type": 1
    },
    {
        "name": "诸暨",
        "sub": [
            {
                "name": "浙江省绍兴市诸暨市"
            }
        ],
        "type": 1
    }
]
