#encoding:utf-8
module Patch::ProfilesHelper
	def education_options
		%w(高中及以下 大学专科 大学本科 硕士 博士及以上)
	end

	def vocation_options
		["商业/贸易",
		 "银行/金融/证券/保险/投资",
		 "建筑/房地产",
		 "法律/司法",
		 "健康/医疗服务",
		 "旅游/餐饮/酒店",
		 "文化/娱乐/体育",
		 "媒体/广告/咨询",
		 "教育/科研",
		 "其他"]
	end

	def job_options
		["企业雇主/企业经营者",
		"高级行政人员（行政总裁/总经理/董事等）",
		"中层管理人员（总监/经理/主任等）",
		"专业人士（会计师、律师、医生、教师等）",
		"公务员、公共事业单位员工",
		"艺术家（画家/音乐家/雕塑家等）",
		"时尚圈人士（时尚达人/模特/演员/歌星等）",
		"家庭主妇",
		"其他"]
	end

	def income_options
		["1万以下","1万~5万","5万~10万","10万~20万","20万以上"]
	end

	def height_options
		["150以下","150~154","155~159","160~164","165~169","170~174","175~179","180以上"]
	end
	
	def weight_options
		["40以下","40~44","45~49","50~54","55~59","60~64","65~69","70以上"]
		
	end

	def shoe_size_options
		["32以下","32","33","34","35","36","37","38","39","40","40以上"]
	end

	def price_options
		["499元以下",
		"500~999元",
		"1000~1499元",
		"1500~1999元",
		"2000~4999元",
		"5000元以上"]
	end

	def place_options
		%w(商务洽谈 时尚派对 晚装派对)
	end

	def interest_options
		%w(艺术 音乐 舞蹈 时尚 理财 购物 旅行 阅读 上网 其他)
	end

	def color_options
		{:white=>"白色",
		:black=>"黑色",
		:patterned=>"花色",
		:brown=>"棕色系",
		:golden=>"金色系",
		:silver=>"银色系",
		:purple=>"紫色系",
		:blue=>"蓝色系",
		:gray=>"灰色系",
		:pink=>"粉色系",
		:red=>"红色系",
		:orange=>"橙色系",
		:yellow=>"黄色系",
		:green=>"绿色系"}
	end

	def year_options
		{"40后"=>40,
		"50后"=>50,
		"60后"=>60,
		"70后"=>70,
		"80后"=>80,
		"90后"=>90}
	end

end
